In [1]:
import pandas as pd
import os

In [2]:
directory_path = "Cleaned data"
os.makedirs(directory_path, exist_ok=True)

In [3]:
# Reading target data
target = pd.read_csv("CSUSHPINSA.csv")

In [4]:
target.head()

         DATE  CSUSHPINSA
0  2003-08-01     135.966
1  2003-09-01     137.076
2  2003-10-01     137.975
3  2003-11-01     138.765
4  2003-12-01     139.627

In [5]:
target.set_index('DATE', inplace =True)
target.rename(columns= {'CSUSHPINSA': 'target'}, inplace =True)
target.index = pd.to_datetime(target.index)
target = target["2003-08-01":"2023-08-01"]

In [6]:
target.shape

(241, 1)

In [7]:
target.to_csv("Cleaned data/target.csv")

In [8]:
population = pd.read_csv('POP.csv')

In [9]:
population.head()

         DATE       POP
0  2003-08-01  291072.0
1  2003-09-01  291321.0
2  2003-10-01  291574.0
3  2003-11-01  291807.0
4  2003-12-01  292008.0

In [10]:
population.set_index('DATE', inplace =True)
population.rename(columns= {'POPTHM': 'population'}, inplace =True)
population.index = pd.to_datetime(population.index)
population = population["2003-08-01":"2023-08-01"]

In [11]:
population.shape

(241, 1)

In [12]:
population.to_csv('Cleaned data/population.csv')

In [13]:
income = pd.read_csv('PI.csv')

In [14]:
income.head()

         DATE      PI
0  2003-08-01  9538.8
1  2003-09-01  9582.5
2  2003-10-01  9620.4
3  2003-11-01  9688.2
4  2003-12-01  9713.2

In [15]:
income.set_index('DATE', inplace =True)
income.rename(columns= {'PI': 'income'}, inplace =True)
income.index = pd.to_datetime(income.index)
income = income["2003-08-01":"2023-08-01"]

In [16]:
income.shape

(241, 1)

In [17]:
income.to_csv("Cleaned data/income.csv")

In [18]:
gdp = pd.read_csv("GDP.csv")

In [19]:
gdp.head()

         DATE        GDP
0  2003-07-01  11566.669
1  2003-10-01  11772.234
2  2004-01-01  11923.447
3  2004-04-01  12112.815
4  2004-07-01  12305.307

In [20]:
gdp.set_index('DATE', inplace =True)
gdp.index = pd.to_datetime(gdp.index)

# Resampling
gdp = gdp.resample('M').ffill()

# # Set the day of the index to 1
gdp.index = gdp.index.map(lambda x: x.replace(day=1))
gdp = gdp["2003-07-01":"2023-07-01"]

In [21]:
gdp.shape

(241, 1)

In [22]:
gdp.to_csv("Cleaned data/gdp.csv")

In [23]:
unemployed_rate = pd.read_csv('UNRATE.csv')

In [24]:
unemployed_rate.head()

         DATE  UNRATE
0  2003-08-01     6.1
1  2003-09-01     6.1
2  2003-10-01     6.0
3  2003-11-01     5.8
4  2003-12-01     5.7

In [25]:
unemployed_rate.set_index('DATE', inplace =True)
unemployed_rate.rename(columns= {'UNRATE': 'unemployed_rate'}, inplace =True)
unemployed_rate.index = pd.to_datetime(unemployed_rate.index)
unemployed_rate = unemployed_rate["2003-08-01":"2023-08-01"]

In [26]:
unemployed_rate.shape

(241, 1)

In [27]:
unemployed_rate.to_csv("Cleaned data/unemployed_rate.csv")

In [28]:
mortgage =pd.read_csv("MORTGAGE30US.csv")

In [29]:
mortgage.head()

         DATE  MORTGAGE30US
0  2003-08-01          6.14
1  2003-08-08          6.34
2  2003-08-15          6.24
3  2003-08-22          6.28
4  2003-08-29          6.32

In [30]:
mortgage.set_index('DATE', inplace =True)
mortgage.rename(columns= {'MORTGAGE30US': 'mortgage_rate'}, inplace =True)
mortgage.index = pd.to_datetime(mortgage.index)
mortgage = mortgage["2003-08-01":"2023-07-27"]

In [31]:
mortgage.shape

(1044, 1)

In [32]:
mortgage.to_csv("Cleaned data/mortgage.csv")

In [33]:
emratio = pd.read_csv("EMRATIO.csv")

In [34]:
emratio.head()

         DATE  EMRATIO
0  2003-08-01     62.1
1  2003-09-01     62.0
2  2003-10-01     62.1
3  2003-11-01     62.3
4  2003-12-01     62.2

In [35]:
emratio.set_index('DATE', inplace =True)
emratio.rename(columns= {'EMRATIO': 'emratio'}, inplace =True)
emratio.index = pd.to_datetime(emratio.index)
emratio = emratio["2003-08-01":"2023-08-01"]

In [36]:
emratio.shape

(241, 1)

In [37]:
emratio.to_csv("Cleaned data/emratio.csv")

In [38]:
permit = pd.read_csv("PERMIT.csv")

In [39]:
permit.head()

         DATE  PERMIT
0  2003-08-01  1966.0
1  2003-09-01  1961.0
2  2003-10-01  2012.0
3  2003-11-01  1918.0
4  2003-12-01  1987.0

In [40]:
permit.set_index('DATE', inplace =True)
permit.rename(columns= {'PERMIT': 'permit'}, inplace =True)
permit.index = pd.to_datetime(permit.index)
permit = permit["2003-08-01":"2023-08-01"]

In [41]:
permit.shape

(241, 1)

In [42]:
permit.to_csv("Cleaned data/permit.csv")

In [43]:
labor_percent = pd.read_csv("CIVPART.csv")

In [44]:
labor_percent.head()

         DATE  CIVPART
0  2003-08-01     66.1
1  2003-09-01     66.1
2  2003-10-01     66.1
3  2003-11-01     66.1
4  2003-12-01     65.9

In [45]:
labor_percent.set_index('DATE', inplace =True)
labor_percent.rename(columns= {'CIVPART': 'labor_percent'}, inplace =True)
labor_percent.index = pd.to_datetime(labor_percent.index)
labor_percent = labor_percent["2003-08-01":"2023-08-01"]

In [46]:
labor_percent.shape

(241, 1)

In [47]:
labor_percent.to_csv("Cleaned data/labor_percent.csv")

In [48]:
monthly_supply = pd.read_csv("MSACSR.csv")

In [49]:
monthly_supply.head()

         DATE  MSACSR
0  2003-08-01     3.5
1  2003-09-01     3.8
2  2003-10-01     3.8
3  2003-11-01     4.1
4  2003-12-01     4.0

In [50]:
monthly_supply.set_index('DATE', inplace =True)
monthly_supply.rename(columns= {'MSACSR': 'monthly_supply'}, inplace =True)
monthly_supply.index = pd.to_datetime(monthly_supply.index)
monthly_supply = monthly_supply["2003-08-01":"2023-08-01"]

In [51]:
monthly_supply.shape

(241, 1)

In [52]:
monthly_supply.to_csv("Cleaned data/monthly_supply.csv")

In [53]:
House_starts = pd.read_csv("HOUST.csv")

In [54]:
House_starts.head()

         DATE   HOUST
0  2003-08-01  1833.0
1  2003-09-01  1939.0
2  2003-10-01  1967.0
3  2003-11-01  2083.0
4  2003-12-01  2057.0

In [55]:
House_starts.set_index('DATE', inplace =True)
House_starts.rename(columns= {'HOUST': 'house_st'}, inplace =True)
House_starts.index = pd.to_datetime(House_starts.index)
House_starts = House_starts["2003-08-01":"2023-08-01"]

In [56]:
House_starts.shape

(241, 1)

In [57]:
House_starts.to_csv("Cleaned data/House_starts.csv")

In [58]:
MSPUS = pd.read_csv("MSPUS.csv")

In [59]:
MSPUS.head()

         DATE     MSPUS
0  2003-07-01  191900.0
1  2003-10-01  198800.0
2  2004-01-01  212700.0
3  2004-04-01  217600.0
4  2004-07-01  213500.0

In [60]:
MSPUS.set_index('DATE', inplace =True)
MSPUS.index = pd.to_datetime(MSPUS.index)

# Resampling
MSPUS = MSPUS.resample('M').ffill()

# # Set the day of the index to 1
MSPUS.index = MSPUS.index.map(lambda x: x.replace(day=1))
MSPUS = MSPUS["2003-07-01":"2023-07-01"]

In [61]:
MSPUS.shape

(241, 1)

In [62]:
MSPUS.to_csv("Cleaned data/MSPUS.csv")

In [63]:
PPI_Cement = pd.read_csv("PCU32733273.csv")

In [64]:
PPI_Cement.head()

         DATE  PCU32733273
0  2003-12-01        100.0
1  2004-01-01        100.9
2  2004-02-01        101.7
3  2004-03-01        101.7
4  2004-04-01        102.4

In [65]:
PPI_Cement.set_index('DATE', inplace =True)
PPI_Cement.rename(columns= {'PCU32733273': 'PPI_Cement'}, inplace =True)
PPI_Cement.index = pd.to_datetime(PPI_Cement.index)
PPI_Cement = PPI_Cement["2003-12-01":"2023-08-01"]

In [66]:
PPI_Cement.shape

(237, 1)

In [67]:
PPI_Cement.to_csv("Cleaned data/PPI_Cement.csv")

In [68]:
PPI_Concrete = pd.read_csv("PCU32733132733106.csv")

In [69]:
PPI_Concrete.head()

         DATE  PCU32733132733106
0  2003-08-01              154.4
1  2003-09-01              154.4
2  2003-10-01              154.4
3  2003-11-01              154.4
4  2003-12-01              154.4

In [70]:
PPI_Concrete.set_index('DATE', inplace =True)
PPI_Concrete.rename(columns= {'PCU32733132733106': 'PPI_Concrete'}, inplace =True)
PPI_Concrete.index = pd.to_datetime(PPI_Concrete.index)
PPI_Concrete = PPI_Concrete["2003-08-01":"2023-08-01"]

In [71]:
PPI_Concrete.shape

(241, 1)

In [72]:
PPI_Concrete.to_csv("Cleaned data/PPI_Concrete.csv")

In [73]:
all_Const_Emp = pd.read_csv("CES2023610001.csv")

In [74]:
all_Const_Emp.head()

         DATE  CES2023610001
0  2003-08-01          840.2
1  2003-09-01          850.2
2  2003-10-01          854.6
3  2003-11-01          858.5
4  2003-12-01          863.3

In [75]:
all_Const_Emp.set_index('DATE', inplace =True)
all_Const_Emp.rename(columns= {'CES2023610001': 'all_Const_Emp'}, inplace =True)
all_Const_Emp.index = pd.to_datetime(all_Const_Emp.index)
all_Const_Emp = all_Const_Emp["2003-08-01":"2023-08-01"]

In [76]:
all_Const_Emp.shape

(241, 1)

In [77]:
all_Const_Emp.to_csv("Cleaned data/all_Const_Emp.csv")

In [78]:
total_emp_cons = pd.read_csv("USCONS.csv")

In [79]:
total_emp_cons.head()

         DATE  USCONS
0  2003-08-01    6760
1  2003-09-01    6783
2  2003-10-01    6784
3  2003-11-01    6796
4  2003-12-01    6827

In [80]:
total_emp_cons.set_index('DATE', inplace =True)
total_emp_cons.rename(columns= {'USCONS': 'total_emp_cons'}, inplace =True)
total_emp_cons.index = pd.to_datetime(total_emp_cons.index)
total_emp_cons = total_emp_cons["2003-08-01":"2023-08-01"]

In [81]:
total_emp_cons.shape

(241, 1)

In [82]:
total_emp_cons.to_csv("Cleaned data/total_emp_cons.csv")

In [83]:
IPI_Cement = pd.read_csv("IPN32731S.csv")

In [84]:
IPI_Cement.head()

         DATE  IPN32731S
0  2003-08-01   152.4980
1  2003-09-01   154.9852
2  2003-10-01   162.1132
3  2003-11-01   156.7902
4  2003-12-01   160.2710

In [85]:
IPI_Cement.set_index('DATE', inplace =True)
IPI_Cement.rename(columns= {'IPN32731S': 'IPI_Cement'}, inplace =True)
IPI_Cement.index = pd.to_datetime(IPI_Cement.index)
IPI_Cement = IPI_Cement["2003-08-01":"2023-07-01"]

In [86]:
IPI_Cement.shape

(240, 1)

In [87]:
IPI_Cement.to_csv("Cleaned data/IPI_Cement.csv")

In [88]:
home_ow_rate = pd.read_csv("RHORUSQ156N.csv")

In [89]:
home_ow_rate.head()

         DATE  RHORUSQ156N
0  2003-07-01         68.4
1  2003-10-01         68.6
2  2004-01-01         68.6
3  2004-04-01         69.2
4  2004-07-01         69.0

In [90]:
home_ow_rate.set_index('DATE', inplace =True)
home_ow_rate.index = pd.to_datetime(home_ow_rate.index)
home_ow_rate.rename(columns= {'RHORUSQ156N': 'home_ow_rate'}, inplace =True)

home_ow_rate = home_ow_rate.resample('M').ffill()

home_ow_rate.index = home_ow_rate.index.map(lambda x: x.replace(day=1))
home_ow_rate = home_ow_rate["2003-07-01":"2023-07-01"]

In [91]:
home_ow_rate.shape

(241, 1)

In [92]:
home_ow_rate.to_csv("Cleaned data/home_ow_rate.csv")

In [93]:
p_saving_rate =pd.read_csv("PSAVERT.csv")

In [94]:
p_saving_rate.head()

         DATE  PSAVERT
0  2003-08-01      5.7
1  2003-09-01      4.9
2  2003-10-01      5.0
3  2003-11-01      5.0
4  2003-12-01      5.0

In [95]:
p_saving_rate.set_index('DATE', inplace =True)
p_saving_rate.rename(columns= {'PSAVERT': 'p_saving_rate'}, inplace =True)
p_saving_rate.index = pd.to_datetime(p_saving_rate.index)
p_saving_rate = p_saving_rate["2003-08-01":"2023-08-01"]

In [96]:
p_saving_rate.shape

(241, 1)

In [97]:
p_saving_rate.to_csv("Cleaned data/p_saving_rate.csv")

In [98]:
new_private_house = pd.read_csv("COMPUTSA.csv")

In [99]:
new_private_house.head()

         DATE  COMPUTSA
0  2003-08-01    1570.0
1  2003-09-01    1719.0
2  2003-10-01    1728.0
3  2003-11-01    1692.0
4  2003-12-01    1716.0

In [100]:
new_private_house.set_index('DATE', inplace =True)
new_private_house.rename(columns= {'COMPUTSA': 'new_private_house'}, inplace =True)
new_private_house.index = pd.to_datetime(new_private_house.index)
new_private_house = new_private_house["2003-08-01":"2023-08-01"]

In [101]:
new_private_house.shape

(241, 1)

In [102]:
new_private_house.to_csv("Cleaned data/new_private_house.csv")

In [103]:
new_private_hw_under = pd.read_csv("UNDCONTSA.csv")

In [104]:
new_private_hw_under.head()

         DATE  UNDCONTSA
0  2003-08-01     1102.0
1  2003-09-01     1121.0
2  2003-10-01     1135.0
3  2003-11-01     1158.0
4  2003-12-01     1183.0

In [105]:
new_private_hw_under.set_index('DATE', inplace =True)
new_private_hw_under.rename(columns= {'UNDCONTSA': 'new_private_hw_under'}, inplace =True)
new_private_hw_under.index = pd.to_datetime(new_private_hw_under.index)
new_private_hw_under = new_private_hw_under["2003-08-01":"2023-08-01"]

In [106]:
new_private_hw_under.shape

(241, 1)

In [107]:
new_private_hw_under.to_csv("Cleaned data/new_private_hw_under.csv")